let arabic = {
    serverError: "حدث خطا غير متوقع",
    unauthorized: "لا يمكن الوصول الي هذا النقطة حاليا",
    genrale: {
        required: "هذا الحقل مطلوب",
        unique: "تم استخدامه من قبل",
        lowercase: "يجب ان تكون كل الحروف صغيرة"
    },
    register: {
        success: "تم تسجيل الدخول بنجاح, في انتظار القبول من المدرس",
        faild: {
            email: "البريد الالكتروني مستخدم من قبل",
            phoneNumber: "الرقم الهاتف مستخدم من قبل",
            name: "يجب ان يكون الاسم رباعي",
        }
    },
    login: {
        success: "تم تسجيل الدخول بنجاح",
        faild: {
            email: "البريد الالكتروني المستخدم غير صحيح",
            password: "كلمة المرور خاطئة",
            unaccepted: "لا يمكنك الدخول الي التطبيق الان . انت في انتظار القبول من المدرس"
        }
    }
}

module.exports = {
    serverError: "something went wrong",
    unauthorized: "لا يمكن الوصول الي هذا النقطة حاليا",
    genrale: {
        required: "هذا الحقل مطلوب",
        unique: "تم استخدامه من قبل",
        lowercase: "يجب ان تكون كل الحروف صغيرة"
    },
    register: {
        success: "تم تسجيل الدخول بنجاح, في انتظار القبول من المدرس",
        faild: {
            email: "البريد الالكتروني مستخدم من قبل",
            phoneNumber: "الرقم الهاتف مستخدم من قبل",
            name: "يجب ان يكون الاسم رباعي",
        }
    },
    login: {
        success: "تم تسجيل الدخول بنجاح",
        faild: {
            email: "البريد الالكتروني المستخدم غير صحيح",
            password: "كلمة المرور خاطئة",
            unaccepted: "لا يمكنك الدخول الي التطبيق الان . انت في انتظار القبول من المدرس"
        }
    }
}

// module.exports = {
//     genrale: {
//         required: "هذا الحقل متطلب",
//         unique: "تم استخدامه من قبل",
//         lowercase: "يجب ان تكون كل الحروف صغيرة"
//     },
//     register: {
//         success: "تم تسجيل الدخول بنجاح, في انتظار القبول من المدرس",
//         faild: {
//             email: "البريد الالكتروني مستخدم من قبل",
//             phoneNumber: "الرقم الهاتف مستخدم من قبل",
//             name: "يجب ان يكون الاسم رباعي",
//         }
//     },
//     login: {
//         success: "تم تسجيل الدخول بنجاح",
//         faild: {
//             email: "البريد الالكتروني المستخدم غير صحيح",
//             password: "كلمة المرور خاطئة",
//             unaccepted: "لا يمكنك الدخول الي التطبيق الان . انت في انتظار القبول من المدرس"
//         }
//     }
// }